## Workplace Satisfaction Survey Analysis

<h4>Importing Modules</h4>

In [1]:
import numpy as np
import pandas as pd  #for dataframes
import matplotlib.pyplot as plt #for plotting graphs
import seaborn as sns

%matplotlib inline

plt.style.use('seaborn-whitegrid')

<h4>Loading Datasets</h4>

In [2]:
#creating a Pandas DataFrame
#using read_excel function
#that reads from a excel file.

survey_data_file = './Dataset/WorkPlaceSatisfactionSurveyData.xlsx'
df_survey_data = pd.read_excel(survey_data_file)

additional_survey_data_file = './Dataset/WorkPlaceSatisfactionSurveyData_add.xlsx'
df_additional_survey_data = pd.read_excel(additional_survey_data_file)

<h4>Summary of Data </h4>

In [3]:
df_survey_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   number                  82 non-null     int64
 1   gender                  82 non-null     int64
 2   age                     82 non-null     int64
 3   family                  82 non-null     int64
 4   education               81 non-null     float64
 5   years_of_service        80 non-null     float64
 6   salary                  82 non-null     int64
 7   sat_management          82 non-null     int64
 8   sat_colleques           81 non-null     float64
 9   sat_workingEnvironment  82 non-null     int64
 10  sat_salary              82 non-null     int64
 11  sat_tasks               82 non-null     int64
 12  healtcare               47 non-null     float64
 13  holidayCabin            20 non-null     float64
 14  gym                     9 non-null      float64
 15  muscleCare              22 non-null     float64
dtypes: float64(7), int64(9)
memory usage: 10.4 KB

In [4]:
df_additional_survey_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   number                  8 non-null      int64
 1   gender                  8 non-null      int64
 2   age                     8 non-null      int64
 3   family                  8 non-null      int64
 4   education               8 non-null      int64
 5   years_of_service        8 non-null      int64
 6   salary                  8 non-null      int64
 7   sat_management          8 non-null      int64
 8   sat_colleques           8 non-null      int64
 9   sat_workingEnvironment  8 non-null      int64
 10  palkkat                 8 non-null      int64
 11  sat_tasks               8 non-null      int64
 12  healtCare               8 non-null      int64
 13  holidayCabin            0 non-null      float64
 14  gym                     4 non-null      float64
 15  muscleCare              1 non-null      float64
dtypes: float64(3), int64(13)
memory usage: 1.1 KB

<h4>Data Cleaning and Preparation</h4>

<h5>Renaming Column and Merging The Data Frames <h5>

 There are two columns with different name but with same meaning and similar data. So rename the column palkkat to sat_salary from df_additional_survey_data and concat it to the main survey data frame. The column name for healthcare is different  rename these column on both data frame.

In [5]:
df_survey_data = df_survey_data.rename(columns={'healtcare':'healthCare'})
df_additional_survey_data = df_additional_survey_data.rename(columns={'healtCare':'healthCare','palkkat':'sat_salary'})
df_survey_data = pd.concat([df_survey_data,df_additional_survey_data],ignore_index=True)

Checking Dataset After Merge

In [6]:
df_survey_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   number                  90 non-null     int64
 1   gender                  90 non-null     int64
 2   age                     90 non-null     int64
 3   family                  90 non-null     int64
 4   education               89 non-null     float64
 5   years_of_service        88 non-null     float64
 6   salary                  90 non-null     int64
 7   sat_management          90 non-null     int64
 8   sat_colleques           89 non-null     float64
 9   sat_workingEnvironment  90 non-null     int64
 10  sat_salary              90 non-null     int64
 11  sat_tasks               90 non-null     int64
 12  healthCare              55 non-null     float64
 13  holidayCabin            20 non-null     float64
 14  gym                     13 non-null     float64
 15  muscleCare              23 non-null     float64
dtypes: float64(7), int64(9)
memory usage: 11.4 KB

In [8]:
df_survey_data.tail()

,number,gender,age,family,education,years_of_service,salary,sat_management,sat_colleques,sat_workingEnvironment,sat_salary,sat_tasks,healthCare,holidayCabin,gym,muscleCare
85,86,1,40,1,2.0,0.0,2500,3,4.0,3,2,3,1.0,NaN,1.0,NaN
86,87,1,31,1,4.0,1.0,3500,4,4.0,3,3,3,1.0,NaN,1.0,NaN
87,88,1,28,1,4.0,0.0,4600,4,3.0,2,4,2,1.0,NaN,NaN,NaN
88,89,1,29,1,4.0,0.0,3900,4,3.0,3,4,3,1.0,NaN,NaN,NaN
89,90,2,31,2,2.0,0.0,2400,4,3.0,2,2,3,1.0,NaN,1.0,NaN

Checking for missing values using isnull()

In [9]:
df_survey_data.isnull()

,number,gender,age,family,education,years_of_service,salary,sat_management,sat_colleques,sat_workingEnvironment,sat_salary,sat_tasks,healthCare,holidayCabin,gym,muscleCare
0,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True,True
1,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True,True
2,False,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True
3,False,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True
4,False,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
85,False,False,False,False,False,False,False,False,False,False,False,False,False,True,False,True
86,False,False,False,False,False,False,False,False,False,False,False,False,False,True,False,True
87,False,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True
88,False,False,False,False,False,False,False,False,False,False,False,False,False,True,True,True
89,False,False,False,False,False,False,False,False,False,False,False,False,False,True,False,True

Replace NaN values with zeros

In [11]:
df_survey_data = df_survey_data.fillna(0)
df_survey_data.head()

,number,gender,age,family,education,years_of_service,salary,sat_management,sat_colleques,sat_workingEnvironment,sat_salary,sat_tasks,healthCare,holidayCabin,gym,muscleCare
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,0.0,0.0,0.0,0.0
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,0.0,0.0,0.0,0.0
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,0.0,0.0,0.0
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,0.0,0.0,0.0
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,0.0,0.0,0.0

Convert columns with datatype float to int

In [12]:
#displaying datatypes
df_survey_data.dtypes

number                      int64
gender                      int64
age                         int64
family                      int64
education                 float64
years_of_service          float64
salary                      int64
sat_management              int64
sat_colleques             float64
sat_workingEnvironment      int64
sat_salary                  int64
sat_tasks                   int64
healthCare                float64
holidayCabin              float64
gym                       float64
muscleCare                float64
dtype: object

In [14]:
df_survey_data = df_survey_data.astype({"education":'int', "years_of_service":'int',"sat_colleques":'int',"healthCare":'int',"holidayCabin":'int',"gym":'int',"muscleCare":'int'})

In [16]:
df_survey_data.dtypes

number                    int64
gender                    int64
age                       int64
family                    int64
education                 int32
years_of_service          int32
salary                    int64
sat_management            int64
sat_colleques             int32
sat_workingEnvironment    int64
sat_salary                int64
sat_tasks                 int64
healthCare                int32
holidayCabin              int32
gym                       int32
muscleCare                int32
dtype: object

In [17]:
df_survey_data.head()

,number,gender,age,family,education,years_of_service,salary,sat_management,sat_colleques,sat_workingEnvironment,sat_salary,sat_tasks,healthCare,holidayCabin,gym,muscleCare
0,1,1,38,1,1,22,3587,3,3,3,3,3,0,0,0,0
1,2,1,29,2,2,10,2963,1,5,2,1,3,0,0,0,0
2,3,1,30,1,1,7,1989,3,4,1,1,3,1,0,0,0
3,4,1,36,2,1,14,2144,3,3,3,3,3,1,0,0,0
4,5,1,24,1,2,4,2183,2,3,2,1,2,1,0,0,0